In [1]:
import pandas as pd

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
     'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
data = pd.DataFrame(people)

In [4]:
data

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
data['first'] + ' ' + data['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [7]:
data['FullName'] = data['first'] + ' ' + data['last']

In [8]:
data

   first     last                    email       FullName
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [10]:
data.drop(columns = ['first','last'],inplace = True)

In [11]:
data

                     email       FullName
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [14]:
data['FullName'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [15]:
data[['first','last']] = data['FullName'].str.split(' ',expand = True)

In [16]:
data

                     email       FullName  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [18]:
data.append({
    'FullName':'Umer Khan'
},ignore_index=True)

C:\Users\hashi\AppData\Local\Temp\ipykernel_2804\1932844567.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data.append({

                     email       FullName  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN      Umer Khan    NaN      NaN

In [19]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [21]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [23]:
df = data.append(df2)

C:\Users\hashi\AppData\Local\Temp\ipykernel_2804\303066787.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = data.append(df2)

In [29]:
df.reset_index(inplace = True)

In [30]:
df.drop(index=4)

   index                    email       FullName  first     last
0      0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1      1        JaneDoe@email.com       Jane Doe   Jane      Doe
2      2        JohnDoe@email.com       John Doe   John      Doe
3      0       IronMan@avenge.com            NaN   Tony    Stark